[
    {
        "title": "Trending News & Headlines - USA TODAY",
        "snippet": "AI to take drive-thru orders at hundreds of Taco Bell, Pizza Hut spots. Watch as dog social distances himself from other pups during walks.",
        "link": "https://www.usatoday.com/news/trending/",
        "source": ""
    },
    {
        "title": "Trending - The New York Times",
        "snippet": "Trending · Snow White and the Seven Kajillion Controversies · Dr. Lindsay C. Gibson Thinks Compassion for Our Parents Can Be a Trap · What 6 Voters Think of ...",
        "link": "https://www.nytimes.com/trending/",
        "source": ""
    },
    {
        "title": "U.S. and World News Headlines : NPR",
        "snippet": "Israel strikes multiple sites in southern Lebanon in response to rocket attack · March 22, 2025 • Lebanese health officials said two people were killed, ...",
        "link": "https://www.npr.org/sections/news/",
        "source": ""
    },
    {
        "title": "World news - breaking news, video, headlines and opinion | CNN",
        "snippet": "Ukraine port city 'on fire' after 'massive' Russian attack as Trump projects optimism ahead of peace talks · Sudan army reclaims presidential palace in major ...",
        "link": "https://www.cnn.com/world",
        "source": ""
    },
    {
        "title": "Trending News, Viral Videos, Photos, Social Media Trends - News18",
        "snippet": "viral news · Video Of Meerut 'Killer' Wife's Lover Attacked Outside Court Goes Viral, Sparks Mixed Reactions · David Miller Didn't Deserve This: Why 'Heartbreak' ...",
        "link": "https://www.news18.com/viral/",
        "source": ""
    },
    {
        "title": "Viral news & latest pictures from Newsweek.com",
        "snippet": "All the latest breaking news on Viral. Browse Newsweek archives of photos, videos and articles on Viral.",
        "link": "https://www.newsweek.com/topic/viral",
        "source": ""
    },
    {
        "title": "Latest News, Photos, Videos on Viral Stories - NDTV.COM",
        "snippet": "Video: Cop Fires In Air During Wedding In UP, Another Dances, Both Suspended ... A video of celebratory firing at a wedding in Uttar Pradesh's Muzaffarnagar has ...",
        "link": "https://www.ndtv.com/topic/viral-stories",
        "source": ""
    },
    {
        "title": "Viral News - Times Now",
        "snippet": "Corporate Trips Are Turning Rishikesh Ganga Into a Dump of Liquor Bottles · Cab Driver Stunned As German Tourist Speaks Fluent Malayalam Internet Amazed She ...",
        "link": "https://www.timesnownews.com/viral",
        "source": ""
    },
    {
        "title": "Top TikTok Trends to Try This Week: Updated Regularly in 2025",
        "snippet": "Looking for TikTok inspo? Your go-to resource for the hottest TikTok trends this year & how to incorporate them to your strategy. Updated bi-weekly!",
        "link": "https://later.com/blog/tiktok-trends/",
        "source": ""
    },
    {
        "title": "Social media - BBC News",
        "snippet": "'Chubby filter' pulled from TikTok after user backlash · Mothers of stabbed teens say killer 'gloated' in rap · 'It's amazing being an overnight TikTok sensation'.",
        "link": "https://www.bbc.com/news/topics/c207p54m4pdt",
        "source": ""
    },
    {
        "title": "Social Media - The New York Times",
        "snippet": "As experts look to unemployment or G.D.P., people online are turning to pop culture moments (like Will Smith's new album or a new “Ted Lasso” season) as signs ...",
        "link": "https://www.nytimes.com/topic/subject/social-media",
        "source": ""
    },
    {
        "title": "Social Media | US News",
        "snippet": "Democrats' New Digital Strategy Tops Trending Charts but Also Draws Mockery From Allies and Foes. Democratic lawmakers are courting online content creators, ...",
        "link": "https://www.usnews.com/topics/subjects/social-media",
        "source": ""
    },
    {
        "title": "Hickory NC Events & Information | Facebook",
        "snippet": "A place to share local events and information about Hickory and the surrounding areas.",
        "link": "https://www.facebook.com/groups/987910851317090/",
        "source": ""
    },
    {
        "title": "USA TODAY - Breaking News and Latest News Today",
        "snippet": "USA TODAY delivers current national and local news, sports, entertainment, finance, technology, and more through award-winning journalism, photos, ...",
        "link": "https://www.usatoday.com/",
        "source": ""
    },
    {
        "title": "Hickory News | Hickory, North Carolina | Read Hickory, NC and ...",
        "snippet": "Read Hickory, NC, North Carolina news from the Hickory Daily Record. Get headlines on local weather, entertainment, and events.",
        "link": "https://hickoryrecord.com/",
        "source": ""
    },
    {
        "title": "Things to Do in Raleigh, N.C. This Weekend | Mar 21-24, 2025",
        "snippet": "There are always great things to do in Raleigh. Make your weekend plans by finding fun events for everyone from foodies, music lovers, families, and more.",
        "link": "https://www.visitraleigh.com/events/this-weekend/",
        "source": ""
    },
    {
        "title": "What's Happening in Sparta, NC (est. 2016) | Facebook",
        "snippet": "Our goal is to inform fellow citizens and visitors about what's happening in Alleghany County. Help us by sharing events, news, ideas, and other...",
        "link": "https://www.facebook.com/groups/1791142531113385/",
        "source": ""
    },
    {
        "title": "FOX and Friends 3/22/25 FULL END SHOW - YouTube",
        "snippet": "FOX and Friends 3/22/25 FULL END SHOW | FOX BREAKING NEWS TRUMP March 22, 2025 5AM Fox & Friends First Carley Shimkus, Todd Piro Kicking off the day, ...",
        "link": "https://www.youtube.com/watch?v=4ywYpR34llg",
        "source": ""
    },
    {
        "title": "Associated Press News: Breaking News, Latest Headlines and ...",
        "snippet": "Timeline of Pope Francis' longest hospital stay as doctors announce his release set for Sunday · UK government orders probe into Heathrow shutdown over ...",
        "link": "https://apnews.com/",
        "source": ""
    },
    {
        "title": "abc11.com - ABC11 WTVD Raleigh Durham Fayetteville North ...",
        "snippet": "Raleigh's source for breaking news and live streaming video online. Covering Raleigh, Durham, Fayetteville and the greater North Carolina region.",
        "link": "https://abc11.com/",
        "source": ""
    },
    {
        "title": "Breaking News, Latest News and Videos | CNN",
        "snippet": "US Politics · Trump says Musk wasn't briefed on China war plan in Pentagon meeting · Trump rescinds security clearances of political rivals Harris, Clinton and ...",
        "link": "https://edition.cnn.com/?refresh=1",
        "source": ""
    }
]